export const GOJUON: string[][] = [
	['あ', 'い', 'う', 'え', 'お'],
	['か', 'き', 'く', 'け', 'こ'],
	['さ', 'し', 'す', 'せ', 'そ'],
	['た', 'ち', 'つ', 'て', 'と'],
	['な', 'に', 'ぬ', 'ね', 'の'],
	['は', 'ひ', 'ふ', 'へ', 'ほ'],
	['ま', 'み', 'む', 'め', 'も'],
	['や', '', 'ゆ', '', 'よ'],
	['ら', 'り', 'る', 'れ', 'ろ'],
	['わ', '', '', '', 'を'],
	['ん', 'ー', '', '', ''],
	['が', 'ぎ', 'ぐ', 'げ', 'ご'],
	['ざ', 'じ', 'ず', 'ぜ', 'ぞ'],
	['だ', 'ぢ', 'づ', 'で', 'ど'],
	['ば', 'び', 'ぶ', 'べ', 'ぼ'],
	['ぱ', 'ぴ', 'ぷ', 'ぺ', 'ぽ'],
	['ぁ', 'ぃ', 'ぅ', 'ぇ', 'ぉ'],
	['ゃ', 'ゅ', 'ょ', 'っ', '']
];
export const CHARS = GOJUON.flat().filter(Boolean);
